[{"title":"Rupee hits record low of 79.97 against US dollar","content":"The rupee hit a record low of 79.97 against the US dollar on Monday after opening at 79.76. The Finance Ministry, while speaking about the matter said that global factors such as the Russia-Ukraine war, soaring crude oil prices and tightening of global financial conditions are the major reasons for the rupee's weakening.","author":"Ridham Gambhir","date":"18 Jul","source":null,"category":"business"},{"title":"Rupee closes at an all-time low of 79.98 against US dollar","content":"The rupee on Monday hit a fresh record low as it ended closer to the 80-mark to close at 79.98 against the US dollar. This was the seventh consecutive session when the rupee weakened. So far this year, the currency has weakened 7.05% against the US dollar. Meanwhile, BSE Sensex closed 760 points higher at 54,521 on Monday.","author":"Ridham Gambhir","date":"18 Jul","source":null,"category":"business"},{"title":"A fighter to the core: Mahindra praises PV Sindhu after she wins Singapore Open","content":"Businessman Anand Mahindra took to Twitter to praise PV Sindhu after she won the Singapore Open. Sharing a tweet by Doordarshan Sports which had an old image of Sindhu, Mahindra wrote, \"That’s not just her facial expression, but the expression of her soul. A fighter to the core...Never getting demoralised by a slump. Teaching us how to rise again.\"","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"business"},{"title":"BCCI had ₹40 cr in bank when I joined & ₹47,680 cr when I was banned: Lalit","content":"In an Instagram post, Lalit Modi asserted that he neither took any government favour nor any bribes from anyone. He added, “I was born with a diamond spoon...When I joined BCCI, it had ₹40 crore in the bank. I joined on my birthday on November 29, 2005. Guess what was in the bank when I was banned - ₹47,680 crore.\"","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"business"},{"title":"11 SEBI officials' email accounts hacked & used to send 34 emails, FIR filed","content":"Mumbai police has filed an FIR after the Securities and Exchange Board of India (SEBI) approached them, alleging the email accounts of its 11 officials had been hacked and used to send as many as 34 emails by unknown persons. \"It was a small incident. CERT-IN is fully in the loop. No sensitive data was lost,\" the markets regulator said.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"business"},{"title":"It is not a sacrifice at all: Bill Gates on plan to give away all his wealth","content":"Microsoft Co-founder Bill Gates, who plans to give away all his wealth, said, \"My giving this money is not a sacrifice at all.\" He added, \"I feel privileged to be involved in tackling these great challenges...and I believe I have an obligation to return my resources to society.\" Gates is currently the world's fourth richest person with $113 billion wealth.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"business"},{"title":"RBI is of the view that cryptocurrencies should be prohibited: FM Sitharaman","content":"The Reserve Bank of India (RBI) has recommended to the government that it should frame regulations for cryptocurrencies and is of the view that they should be prohibited, Finance Minister Nirmala Sitharaman said. Citing the borderless nature of cryptocurrencies, she further said that any legislation for regulation or for banning can be effective only after significant international collaboration.","author":"Hiral Goyal","date":"18 Jul","source":null,"category":"business"},{"title":"How a startup should operate: Mahindra on old video of Man City's 44-pass goal","content":"Businessman Anand Mahindra took to Twitter to share a 2018 video of Manchester City's 44-pass goal against Manchester United and wrote, \"A lesson in teamwork...But also an analogy for how a startup...needs to operate.\" He further said that success comes from going \"back and forth, trying new angles of approach and going for the kill when strategic path is clear\".","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"business"},{"title":"Ex-NSE CEO Chitra's remand extended by 4 days in money laundering case","content":"A Delhi court has extended the four-day remand of former CEO and MD of National Stock Exchange (NSE), Chitra Ramkrishna, in a money laundering case. The case involves alleged phone tapping and snooping of NSE's employees. Earlier, the Enforcement Directorate and CBI registered two more cases against Ramkrishna, former NSE head Ravi Narain and former Mumbai Police Commissioner Sanjay Pandey.","author":"Shreyasi Banerjee","date":"18 Jul","source":null,"category":"business"},{"title":"Which household items will get costlier from tomorrow due to changes in GST rules?","content":"Pre-packaged and labelled food items like curd, lassi and buttermilk will get costlier from July 18 as they'll attract 5% GST. Jaggery, khandsari sugar, puffed rice will no longer be exempt from GST. Kitchen utensils like knives, spoons, forks, and stationery items like pencil sharpeners, maps, globes and electrical appliances such as LED lights and fixtures will also get costlier.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"business"},{"title":"Sunak praises father-in-law Narayana Murthy, says 'His firm employs thousands in UK'","content":"One of the frontrunners for the UK PM's post, Rishi Sunak, said he is proud of what his parents-in-law built. Speaking about Infosys Founder NR Narayana Murthy, Sunak said, \"My father-in-law came from...nothing and just had a dream and a couple of hundred pounds [from my] mother-in-law's savings…He...built one of the world's largest...companies that...employs thousands of people...in the UK.\"","author":"Ridham Gambhir","date":"18 Jul","source":null,"category":"business"},{"title":"New Zealand inflation surges to 7.3%, highest since 1990","content":"Inflation in New Zealand has surged at its fastest pace in over three decades. As per official data, the Consumer Price Index increased 7.3% in the second quarter, up from 6.9% in the first quarter and the fastest since the June quarter of 1990 when prices rose 7.6%. Economists had predicted that inflation would come in at 7% or 7.1%.","author":"Ridham Gambhir","date":"18 Jul","source":null,"category":"business"},{"title":"Saudi Arabia doubled Russian oil imports in Q2, freeing up own oil for exports: Report","content":"The world's largest oil exporter, Saudi Arabia, more than doubled its Russian oil imports in the second quarter, enabling it to free up its own crude for export, as per data accessed by Reuters. It imported 6,47,000 tonnes of Russian oil from April to June. Russia has been selling fuel at discounted prices amid Western sanctions over the Ukraine war.","author":"Ridham Gambhir","date":"18 Jul","source":null,"category":"business"},{"title":"No GST on pre-packed, labelled food items weighing over 25 kg: Finance Ministry","content":"The Finance Ministry has clarified that single packages of pre-packed and labelled food items like cereals and pulses weighing over 25 kg are exempt from 5% GST. It added that if a retail shopkeeper supplies an item in a loose quantity that was bought in a 25-kg pack from a manufacturer, its sale to the consumer will not attract GST.","author":"Ridham Gambhir","date":"18 Jul","source":null,"category":"business"},{"title":"Plea to stop SpiceJet's operations amid recent mishaps dismissed by Delhi HC","content":"The Delhi High Court dismissed a plea seeking to stop the operations of SpiceJet over recent technical snags. The plea cited several incidents involving SpiceJet flights and claimed that passengers' lives are at risk due to their improper management. The DGCA has taken note of incidents involving SpiceJet flights and is free to proceed on its own, the court noted.","author":"Hiral Goyal","date":"18 Jul","source":null,"category":"business"},{"title":"HUL, ITC, United Spirits added 130 execs to crorepati club last fiscal: Report","content":"Hindustan Unilever (HUL), ITC and United Spirits together added over 130 executives to the club of those earning more than ₹1 crore annually during the last fiscal, The Economic Times reported. United Spirits witnessed a massive jump of 113%, whereas HUL and ITC saw 33% and 44% increase in the number of eight-figure salary earners, as per their annual reports.","author":"Hiral Goyal","date":"18 Jul","source":null,"category":"business"},{"title":"Pakistani rupee falls to all-time low of 212 against US dollar","content":"The Pakistani rupee has dropped to a record low against the US dollar with the exchange rate sliding to PKR 212, local media reported on Monday. This fall in the value came after traders resorted to panic buying on reports that some commercial banks had run out of foreign currency, reports stated.","author":"Anmol Sharma","date":"18 Jul","source":null,"category":"business"},{"title":"SEBI clears appointment of BSE chief Ashish Chauhan as new NSE CEO & MD","content":"The Securities and Exchange Board of India has approved the appointment of Ashish Kumar Chauhan as the new MD and CEO of the NSE. Chauhan is currently the MD and CEO of the BSE and will replace Vikram Limaye whose term ended as NSE chief on July 16. The appointment is subject to Chauhan accepting the offer. ","author":"Ridham Gambhir","date":"18 Jul","source":null,"category":"business"},{"title":"Fortune cooking oil prices cut by up to ₹30 per litre by Adani Wilmar","content":"Prices of one of the most popular Indian edible oil brands Fortune have been cut by up to ₹30 per litre amid a fall in global prices. This is the second oil price reduction announced by the brand's maker Adani Wilmar in two months. Prices of soyabean and sunflower oils have been cut to ₹165 and ₹195 per litre, respectively.","author":"Sakshita Khosla","date":"18 Jul","source":null,"category":"business"},{"title":"Bill & Melinda Gates Foundation's half resources have come from Warren: Bill Gates","content":"In a blog, Microsoft Co-founder Bill Gates said that though the foundation is named Bill & Melinda Gates Foundation, \"half of its resources to date have come from Warren Buffett's gifts\". Gates wrote, \"Since 2006, Warren has gifted the foundation $35.7 billion, including his most recent gift of $3.1 billion in June.\"","author":"Ridham Gambhir","date":"18 Jul","source":null,"category":"business"},{"title":"What goods & services get cheaper as new GST rates come into effect today?","content":"Electric vehicles, whether or not fitted with a battery pack, will be eligible for the concessional GST rate of 5% from July 18. GST on renting trucks, and goods carriages (where the cost of fuel is included) will be cut to 12% from 18%. GST on ostomy appliances and orthopaedic equipment like splints will be reduced from 12% to 5%.","author":"Ridham Gambhir","date":"18 Jul","source":null,"category":"business"},{"title":"Scindia chairs meet with heads of airline companies on safety issues","content":"Civil Aviation Minister Jyotiraditya Scindia chaired a one-on-one meeting with heads of airline companies on Monday to review flight safety norms. The Aviation Ministry also issued instructions to each airline to take steps at all levels to enhance security surveillance. These steps come after a few Indian airlines reported back-to-back incidents of emergency landings due to technical issues.","author":"Subhangi Singh","date":"18 Jul","source":null,"category":"business"},{"title":"Hyd authority's one-time scheme offers 90% waiver on property tax arrears","content":"The Telangana government has announced a one-time scheme (OTS) for clearing pending property tax arrears within Greater Hyderabad Municipal Corporation (GHMC) limits and all other urban local bodies. The scheme will allow a waiver of 90% on interest payment, provided that the principal amount plus 10% of interest on accumulated arrears is paid in one go for financial year 2021-22.","author":"Subhangi Singh","date":"18 Jul","source":null,"category":"business"},{"title":"6 of top 10 most valued firms lost ₹1.68 lakh crore in m-cap last week","content":"Among the 10 most valued firms, six companies suffered a combined loss of ₹1.68 lakh crore in their market valuation last week. While TCS took the biggest hit as its market valuation declined by ₹99,270.07 crore to reach ₹10,95,355.32 crore, it was followed by Infosys, whose valuation dropped by ₹35,133.64 crore to ₹6,01,900.14 crore.","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"business"},{"title":"Swedish fashion retailer H&M to exit Russia amid Ukraine war","content":"Swedish fashion retailer H&M said that it will exit from Russia after pausing sales there in March after Moscow's invasion of Ukraine. \"After careful consideration, we see it as impossible given the current situation to continue our business in Russia,\" Chief Executive Helena Helmersson said in a statement. H&M said the move will cost $200 million and affect 6,000 staff. ","author":"Anisha Joneja","date":"18 Jul","source":null,"category":"business"},{"title":"West Indies announce their 13-member squad for ODI series against India","content":"West Indies have announced their 13-member squad for the ODI series against India, which will begin on July 22. Senior all-rounder Jason Holder has been recalled to West Indies' squad, which will be led by Nicholas Pooran. Shai Hope will be West Indies' vice captain. Romario Shepherd and Hayden Walsh Jr have been named as reserve players.","author":"Anmol Sharma","date":"18 Jul","source":null,"category":"sports"},{"title":"Harbhajan takes oath as Rajya Sabha member, says 'will do my best for the nation'","content":"Former cricketer Harbhajan Singh has taken oath as a member of the Rajya Sabha from Punjab. Sharing a video from the ceremony in Parliament, Singh said, \"Took oath...to protect the Constitution, rule of law and dignity of the House. I will do my best for the people of Punjab and the nation..Jai Hind Jai Bharat.\" He was nominated by AAP.","author":"Sakshita Khosla","date":"18 Jul","source":null,"category":"sports"},{"title":"Virat Kohli reacts to Ben Stokes' ODI retirement, calls him 'Most competitive bloke'","content":"Former Team India captain Virat Kohli reacted to England Test captain Ben Stokes announcing his retirement from ODI cricket. \"You're the most competitive bloke I've ever played against. Respect,\" Kohli commented on Stokes' post on Instagram. Stokes said that he will play his last ODI on Tuesday against South Africa.","author":"Anmol Sharma","date":"18 Jul","source":null,"category":"sports"},{"title":"Hardik Pandya shares video of his journey from injury rehab to India comeback","content":"Team India all-rounder Hardik Pandya took to social media to share a video of his journey from injury rehab to Team India comeback. He wrote, \"Through the ups and downs...with my people by my side. Woke up every morning raring to go...with the will to become fitter and play for my country. Always grateful to those who stood by me.\"","author":"Anmol Sharma","date":"18 Jul","source":null,"category":"sports"},{"title":"How does the ODI team rankings table read after India's series victory?","content":"Following their 2-1 ODI series victory against England, India are placed third on the ICC ODI team rankings table. India have accumulated 109 rating points, while fourth-placed Pakistan have 106 rating points. England are currently second with 121 rating points, while New Zealand lead the rankings with 128 rating points.","author":"Anmol Sharma","date":"18 Jul","source":null,"category":"sports"},{"title":"Ben Stokes retires from ODI cricket, says '3 formats are just unsustainable for me now'","content":"England Test captain Ben Stokes has announced his retirement from ODI cricket, saying England's match against South Africa on Tuesday will be his last ODI. \"Three formats are just unsustainable for me now,\" he stated. \"It's time for someone else to progress as a cricketer and make incredible memories like I have over the past 11 years,\" he added.","author":"Anmol Sharma","date":"18 Jul","source":null,"category":"sports"},{"title":"Who are David Beckham and Ronaldo Singh, who will represent India at CWG 2022?","content":"David Beckham and Ronaldo Singh Laitonjam are among the athletes who'll represent India at upcoming CWG 2022. Both are professional cyclists. Beckham is 19 years old and hails from Andaman, while 19-year-old Ronaldo hails from Manipur. David got the name as his maternal uncle was a big fan of ex-England footballer David Beckham, while Ronaldo's name is inspired from Ronaldinho.","author":"Anmol Sharma","date":"18 Jul","source":null,"category":"sports"},{"title":"If I get 20 minutes with Virat Kohli, I might be able to help him: Sunil Gavaskar","content":"Amid Virat Kohli's poor form, Sunil Gavaskar said, \"If I had about 20 minutes with him...I'd...tell him the things he might've to do. It might help him.\" He added, \"Having been an opening batter...having been troubled by [off-stump] line...there are certain things that you try and do. If I get 20 minutes...I might be able to tell him.\"","author":"Anmol Sharma","date":"18 Jul","source":null,"category":"sports"},{"title":"Report claims Ronaldo to join Sporting CP as car seen at stadium, he calls it 'fake'","content":"Manchester United forward Cristiano Ronaldo has branded reports of a return to Sporting CP on loan as 'fake'. Reports had emerged from Portugal on Sunday claiming the Manchester United forward was at Sporting CP's Jose Alvalade Stadium to discuss a loan return to his boyhood club. A report had also included a picture of Ronaldo's car in the stadium.","author":"Anmol Sharma","date":"18 Jul","source":null,"category":"sports"},{"title":"2-time Olympic champion Crouser wins 1st shot put world gold in US sweep","content":"Two-time Olympic gold medallist and world record holder Ryan Crouser won his first shot put gold medal at World Athletics Championships in Oregon on Sunday as he led a US clean sweep with a championship record throw of 22.94 metres. Defending champion Joe Kovacs threw 22.89 metres to clinch silver, while Josh Awotunde won bronze with a 22.29-metre throw.","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"Hardik was fluent in his innings, took pressure off Pant: Zaheer on 3rd ODI","content":"Praising Hardik Pandya for his batting in India's five-wicket win against England in third ODI, Zaheer Khan said the India all-rounder was fluent in his innings and took the pressure off Rishabh Pant by batting at a healthy strike rate. Hardik, who scored a 55-ball 71 at a strike rate of 129.09, stitched a 133-run fifth-wicket partnership with Pant(125*). ","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"Focussed on one ball at a time: Pant on match-winning ton vs England","content":"Talking about his match-winning innings against England in third and final ODI, India wicketkeeper-batter Rishabh Pant said he was focussing on one ball at a time. \"When your team is under pressure and you bat like that...something I aspire to do,\" he added. Chasing 260, Pant hit an unbeaten 125 to help India score 261\/5 in 42.1 overs.\n","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"History tells you Shaheen Afridi blew them away: Nasser on India's top-order","content":"Ex-England captain Nasser Hussain has said Team India's top-order batters struggle against left-arm pacers. \"They need to play left-arm (pacers) a little bit better. History tells you that Shaheen Afridi blew them away one evening...And Reece Topley blew them away here (at Old Trafford),\" he stated. Topley dismissed Shikhar Dhawan, Rohit Sharma and Virat Kohli in the final England ODI.","author":"Ankur Taliyan","date":"18 Jul","source":null,"category":"sports"},{"title":"It was like rollercoaster of emotions: Sindhu after winning Singapore Open","content":"Taking to Twitter after winning her first Singapore Open title, PV Sindhu wrote, \"It was like a rollercoaster of emotions but managed to pull through and win the championship!\" She added, \"Always special to win in Singapore. Time for a much needed breather before the big one in Birmingham.\" It was world number seven Sindhu's third title of the year.","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"Superstar in every format: ECB interim CEO on Stokes after his ODI retirement","content":"After Ben Stokes announced his retirement from ODI cricket, England and Wales Cricket Board (ECB) interim CEO Clare Connor said the England all-rounder is a superstar in every format. \"His remarkable contribution to...World Cup final at Lord's in 2019 enabled England men to win that prestigious trophy for...first time,\" she added. Stokes will play his last ODI on Tuesday.","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"That's the example you give: Zaheer on Hardik-Rishabh's 133 run partnership","content":"Ex-India pacer Zaheer Khan has said the partnership between Rishabh Pant and Hardik Pandya in the third England ODI is the \"example you'd like to give to anyone who is in the batting lineup\". India were 72\/4 when Hardik came in to bat alongside Pant. The duo added 133 runs for the fifth wicket, helping India win by five wickets. ","author":"Ankur Taliyan","date":"18 Jul","source":null,"category":"sports"},{"title":"I'd have definitely tried to hit another one: Sehwag on Pant's 5 consecutive fours","content":"Team India wicketkeeper-batter Rishabh Pant smashed five consecutive fours off England pacer David Willey in the 42nd over in their final ODI on Sunday. Reacting to it, ex-India opener Virender Sehwag said, \"I'd have definitely tried to hit [another] four or a six.\" India needed four runs to win off Willey's last delivery but Pant took a single. ","author":"Ankur Taliyan","date":"18 Jul","source":null,"category":"sports"},{"title":"Run machine, legend-in-the-making: KKR on Smriti Mandhana's 26th birthday","content":"Kolkata Knight Riders took to Twitter to wish India Women limited-overs vice-captain Smriti Mandhana on her 26th birthday on Monday. \"A run machine and a legend-in-the-making!\" wrote KKR. Mumbai Indians tweeted, \"Wishing one of the most gifted batters, Smriti, a very happy birthday from one family.\" Smriti has scored 5,250 runs in 165 international matches so far. ","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"Fraser-Pryce sets championship record in Jamaican sweep of women's 100m","content":"Shelly-Ann Fraser-Pryce won her fifth world title in Jamaican female sprinters' clean sweep of the women's 100m in the ongoing World Athletics Championships. Fraser-Pryce won gold with a new championship record of 10.67 seconds. Shericka Jackson was second, clocking a personal best of 10.73 seconds, while the Tokyo Olympic champion Elaine Thompson-Herah finished third (10.81s). ","author":"Ankur Taliyan","date":"18 Jul","source":null,"category":"sports"},{"title":"Hardik now knows when to bowl bouncer, there's better planning: RP Singh","content":"Former India pacer RP Singh has said all-rounder Hardik Pandya has improved as a bowler after coming back from his back injury. \"Earlier, Hardik used to run in hard and send down short balls. But now, he thinks hard and knows when to bowl the bouncer,\" explained Singh. Hardik registered his career-best ODI figures of 4\/24 against England. ","author":"Ankur Taliyan","date":"18 Jul","source":null,"category":"sports"},{"title":"Kohli should leave excess baggage back in England, start afresh: Ojha","content":"Pragyan Ojha said India batter Virat Kohli should leave the \"excess baggage\" back in England and start afresh. \"He's going through a bad phase. What he can do is cut short...negativity,\" he added. Against England in rescheduled fifth Test, Kohli scored 11 and 20. While he managed 12 runs in two T20Is, he hit 16 and 17 in two ODIs.","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"PM Modi to interact with Indian contingent bound for CWG on July 20","content":"Prime Minister Narendra Modi will interact with 2022 Commonwealth Games-bound Indian contingent on July 20, Wednesday, via video conferencing, his office said on Monday. The interaction will be attended by both athletes as well as their coaches. CWG will be held in Birmingham from July 28 to August 8. A total of 215 athletes will be participating in the event.\n","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"Pleasing to see them dominate on English soil: Laxman on India's 2-1 ODIs win","content":"After India's 2-1 win in the three-match ODI series against England, VVS Laxman said it is very pleasing to see India dominate on English soil. \"A fantastic chase to win the ODI series...partnership between Rishabh Pant and Hardik Pandya was a phenomenal comeback,\" he added. Sachin Tendulkar said, \"Congratulations to Team India...keep up the good work and continue this form.\"","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"This Indian bowling unit is excellent: Siraj after ODI series win vs England","content":"Speaking about India's bowling performance in the recently concluded three-match ODI series against England, pacer Mohammed Siraj stated that the current Indian bowling unit is excellent. \"Like how Hardik Pandya came in and took the wickets of their well-set batters [in third ODI], that phase was really crucial for...team,\" he added. India bowled out England in all three ODIs.","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"It's invaluable to have Hardik in Team India in white-ball cricket: Jaffer","content":"Wasim Jaffer has said it's invaluable to have all-rounder Hardik Pandya in the Indian team in white-ball cricket. Hardik registered bowling figures of 7-3-24-4 and scored 71(55) in India's five-wicket win against England in third ODI. It was the 28-year-old's best-ever bowling figures in ODI cricket. India won the three-match ODI series 2-1. Hardik was adjudged 'Player of the Series'","author":"Anant Kaur","date":"18 Jul","source":null,"category":"sports"},{"title":"Kerala becomes the only state with its own internet service: CM Vijayan","content":"Kerala has become the only state in India with its own internet service, CM Pinarayi Vijayan said on Thursday. \"The Kerala Fiber Optic Network Limited has received the ISP license from the Centre's Department of Telecommunications,\" he added. With this, Kerala's KFON project can kickstart its operations of providing internet as a basic right to our people, Vijayan further said.","author":"Atul Mishra","date":"15 Jul","source":null,"category":"technology"},{"title":"Video shows iPhone lodged with a bullet after it saves Ukrainian soldier's life","content":"A video has gone viral on social media purportedly showing an iPhone 11 Pro stuck with a bullet after it saved a Ukrainian soldier's life. The clip shows the damaged iPhone being taken out of the soldier's backpack after the shot was fired. The bullet couldn't penetrate the iPhone through the backpack, creating a clear bulge and shattering its screen.","author":"Hiral Goyal","date":"18 Jul","source":null,"category":"technology"},{"title":"Amazon pauses work on 6 new US office buildings to redesign for hybrid work","content":"Amazon is pausing construction of six new office buildings in Bellevue and Nashville as it seeks to redesign workspaces for hybrid work. \"We want to make sure that we design them in a way that meets our employees' needs in future,\" Amazon said. Amazon's plan to create 30,000 jobs in Bellevue and Nashville won't be affected by the construction pause.","author":"Hiral Goyal","date":"16 Jul","source":null,"category":"technology"},{"title":"Twitter's sudden speed for trial after 2 months of foot-dragging is a tactic: Musk","content":"Tesla CEO Elon Musk has opposed Twitter's request for a fast-track trial over the $44 billion deal termination. In a filing, Musk said, \"Twitter's sudden request for warp speed after two months of foot-dragging...is its latest tactic to shroud the truth about spam accounts long enough to railroad defendants into closing.\" Twitter has requested that the trial begin in September. \n","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"MHA website ranks 1st among central ministry services portals: Govt","content":"The Ministry of Home Affairs has ranked first and its Digital Police portal second in a service delivery assessment of websites of central government ministries. The National e-Governance Service Delivery Assessment is a periodic assessment intended to improve the effectiveness of the states and Union Territories and the central government in the delivery of their online services to the public.","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Russian space agency chief Dmitry, known for clashes with Musk, fired","content":"Dmitry Rogozin, the Russian space agency chief who had frequent clashes online with SpaceX CEO Elon Musk, has been fired. While Kremlin did not provide a reason for removing him, Rogozin’s exit occurred on the same day that NASA and Roscosmos reached terms on a new agreement to collaborate on International Space Station missions despite the ongoing situation in Ukraine. ","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"Google removes 8 apps infected with new 'Autolycos' malware from Play Store","content":"Google has removed eight apps infected with a new Android malware named 'Autolycos' from Play Store. According to Bleeping Computer, the malware executes URLs on a remote browser and then includes the result in HTTP requests. The removed apps include Vlog Star Video Editor, Creative 3D Launcher, Wow Beauty Camera, Funny Camera, Razer Keyboard & Theme, and Gif Emoji Keyboard.","author":"Hiral Goyal","date":"18 Jul","source":null,"category":"technology"},{"title":"RBI is of the view that cryptocurrencies should be prohibited: FM Sitharaman","content":"The Reserve Bank of India (RBI) has recommended to the government that it should frame regulations for cryptocurrencies and is of the view that they should be prohibited, Finance Minister Nirmala Sitharaman said. Citing the borderless nature of cryptocurrencies, she further said that any legislation for regulation or for banning can be effective only after significant international collaboration.","author":"Hiral Goyal","date":"18 Jul","source":null,"category":"technology"},{"title":"Elon has a real record of success: LinkedIn Co-founder defends Musk against Trump","content":"LinkedIn's billionaire Co-founder Reid Hoffman defended Tesla CEO Elon Musk after former US President Donald Trump called the former a \"bullshit artist\" over the $44 billion Twitter deal. Hoffman tweeted, \"Elon's a classic American immigrant story- an entrepreneur with a real record of success…[Whereas] Trump is a spoiled rich kid who bankrupts everything he touches. Including the US economy.\"","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"No plans for company-wide layoffs: Twitter amid lawsuit against Musk","content":"In a filing, Twitter has said that it isn't looking at company-wide layoffs but could continue to restructure the business. The filing comes a day after it sued Tesla CEO Elon Musk for violating his $44 billion deal. In May, Twitter said it would pause hiring and review all existing job offers to determine whether any \"should be pulled back\".","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Like all firms, we are not immune to economic headwinds: Google CEO to staff","content":"In an internal memo to the staff, Google CEO Sundar Pichai while announcing the company’s plan to slow its hiring, said, \"Like all companies, we’re not immune to economic headwinds\". He added, “The uncertain global economic outlook has been top of mind...We’ve never viewed these types of challenges as obstacles. Instead, we’ve seen them as opportunities to deepen our focus.\"","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Will prove our position in court & we believe we'll prevail: Twitter CEO to staff","content":"Following a lawsuit against Tesla CEO Elon Musk over the $44 billion acquisition agreement, Twitter CEO Parag Agrawal told his staff, \"We will prove our position in court and we believe we will prevail.\" Twitter's lawsuit has accused Musk of \"a long list\" of violations of the merger agreement that \"cast a pall over Twitter and its business\". \n","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Google to slow hiring for rest of the year: CEO Pichai tells employees","content":"Google CEO Sundar Pichai in an internal memo to the staff has announced that they will be \"slowing down the pace of hiring for the rest of the year\" amid an uncertain global economic outlook. He added, Google will focus on hiring for \"critical roles\" and will be \"pausing development\" in some cases and \"re-deploying resources to higher priority areas\". ","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Musk accused lawyers of causing trouble by seeking deal's financing info: Twitter","content":"In its lawsuit against Tesla CEO Elon Musk, Twitter has shared a purported image of a text message that Musk sent to CEO Parag Agrawal before terminating the deal. Musk's message read, \"Your lawyers are using these conversations to cause trouble….That needs to stop.\" Musk's message was in response to the company seeking information regarding the deal's financing.\n","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"It is not a sacrifice at all: Bill Gates on plan to give away all his wealth","content":"Microsoft Co-founder Bill Gates, who plans to give away all his wealth, said, \"My giving this money is not a sacrifice at all.\" He added, \"I feel privileged to be involved in tackling these great challenges...and I believe I have an obligation to return my resources to society.\" Gates is currently the world's fourth richest person with $113 billion wealth.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"technology"},{"title":"Unjustifiable request: Musk files motion against Twitter's bid to fast-track trial","content":"Tesla CEO Elon Musk has filed a motion opposing Twitter's request to fast-track a trial over the $44 billion deal, terming it an \"unjustifiable request\". While Twitter has requested the trial begin in September because the merger agreement with Musk terminates on October 25, Musk has requested a trial date on or after February 13, 2023. ","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"Smartwatch-like wearable that operates without a battery developed in US","content":"Researchers at the University of California, Irvine, have developed a smartwatch-like wearable that can operate without an external power source or a battery. The 3D printed device is capable of keeping a track of the wearer's pulse and communicating wirelessly with a nearby smartphone. It uses an ultra-thin 2D material called MXene, which has unique electrical and mechanical properties.","author":"Hiral Goyal","date":"16 Jul","source":null,"category":"technology"},{"title":"11 SEBI officials' email accounts hacked & used to send 34 emails, FIR filed","content":"Mumbai police has filed an FIR after the Securities and Exchange Board of India (SEBI) approached them, alleging the email accounts of its 11 officials had been hacked and used to send as many as 34 emails by unknown persons. \"It was a small incident. CERT-IN is fully in the loop. No sensitive data was lost,\" the markets regulator said.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"technology"},{"title":"Asked Musk how many kids he plans to have, he said 'Mars needs people': Mark Cuban","content":"Billionaire Mark Cuban said that he once asked Elon Musk how many children he planned on having. \"This was before the last three or whatever it was,\" Cuban said, likely referring to the three children Musk fathered in 2021. \"I'm like, 'Dude, congratulations, how many you going to have?' He sends me a text back, 'Mars needs people',\" Cuban recalled.","author":"Hiral Goyal","date":"18 Jul","source":null,"category":"technology"},{"title":"IT Ministry says content removal on Twitter proportional to Indian user base: Report","content":"The Ministry of Electronics and Information Technology in an official review reportedly stated that the Centre's content removal orders to Twitter are \"proportional\" to the expanding Indian user base. The ministry said, \"India is 7% of Twitter's global user base and so is the volume of removal requests.\" Earlier, Twitter challenged the Centre's 39 blocking orders, saying that they're arbitrary. ","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"Elon Musk's mother shares pics from his startup Zip2's opening event from 1997","content":"Tesla CEO Elon Musk's mother Maye Musk took to Twitter to share pictures of the opening of Zip2's global headquarters in Mountain View, California, in 1997. Zip2, a web software startup that created online city guides for newspapers, was the first company founded by Elon Musk. Earlier, a picture of Musk's 1995 business card of Zip2 went viral on Twitter.","author":"Hiral Goyal","date":"15 Jul","source":null,"category":"technology"},{"title":"Twitter's lawsuit against Musk gets 90-min 1st court hearing on July 19","content":"Twitter’s lawsuit against Tesla CEO Elon Musk over terminating the $44 billion acquisition deal will be first heard in court on July 19. Kathaleen McCormick, the Chancellor of Delaware's Court of Chancery, has set a 90-minute hearing. Notably, Twitter has requested that the trial begins in September because the merger agreement with Musk terminates on October 25.","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"If inflation calms down, Tesla can lower car prices: Musk","content":"Tesla CEO Elon Musk on Friday said that the electric car maker could lower prices for cars if inflation comes down. Responding to a user who asked him if Tesla had any plans to lower prices that it had raised amid the pandemic and supply chain woes, Musk replied, \"If inflation calms down, we can lower prices for cars.\"","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"RBI likely to introduce new rules for fintech firms: Report","content":"The Reserve Bank of India (RBI) is likely to announce new regulations for fintech companies, Moneycontrol reported. The rules will likely cover areas such as data sharing, privacy, compliance with KYC and anti-money laundering norms, the report said. This comes in the wake of complaints related to some fintechs charging usurious interest rates and other issues, the report added.","author":"Apurva Bharadwaj","date":"15 Jul","source":null,"category":"technology"},{"title":"Netflix ties up with Microsoft for cheaper ad-supported subscription","content":"Netflix has announced a partnership with Microsoft for its ad-supported subscription plan. The technology giant will serve as a \"global advertising technology and sales partner\" for the streaming service. Netflix had announced in April that it was looking to offer a cheaper ad-supported option to its customers after nearly 200,000 subscribers left the platform in this year's first quarter.","author":"Apurva Bharadwaj","date":"15 Jul","source":null,"category":"technology"},{"title":"Veteran Bollywood singer Bhupinder Singh passes away at 82","content":"Veteran Bollywood playback and ghazal singer Bhupinder Singh has passed away of a colon ailment at 82 in Mumbai. Singh is known for songs like 'Naam Gum Jayega', 'Kabhi Kisi Ko Mukammal Jahan Nahi Milta' and 'Hothon Pe Aisi Baat'. He's also been credited as a guitarist in famous Bollywood songs like 'Dum Maro Dum' and 'Mehbooba O Mehbooba'.","author":"Sakshita Khosla","date":"18 Jul","source":null,"category":"entertainment"},{"title":"She's the last person to check bank balances, I was penniless: Sushmita's ex Vikram Bhatt","content":"Talking about Sushmita Sen being called a 'gold digger' for dating Lalit Modi, her ex-boyfriend Vikram Bhatt said, \"Sushmita is a love digger, not a gold digger.\" \"Sushmita is the last person who checks...bank balances before she decides to fall in love with someone. I was penniless. I was directing Ghulam, but I had no money,\" he added.","author":"Anmol Sharma","date":"18 Jul","source":null,"category":"entertainment"},{"title":"8-yr-old Aditya Patil wins Dance Deewane Juniors, says 'Will buy a big house'","content":"Aditya Patil has won the first season of the talent reality show 'Dance Deewane Juniors'. The eight-year-old, who is from Gujarat's Surat, was awarded the trophy and ₹20 lakh cash prize. Talking about how he wants to spend the prize money, Aditya told ETimes, \"I will give the winning amount to my grandfather and we will buy a big house.\" \n","author":"Udit Gupta","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Deepika Padukone to play Parvati in 'Brahmastra 2': Report","content":"Deepika Padukone will portray Parvati in 'Brahmastra 2', according to a report. The actress will reportedly also make a cameo appearance in 'Brahmastra Part One: Shiva', which is set to release in theatres on September 9. The upcoming film, starring Ranbir Kapoor, Amitabh Bachchan, Alia Bhatt and Nagarjuna Akkineni, will be released in multiple languages. ","author":"Udit Gupta","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Singers want to be like Arijit today, they're losing their identities: Mame","content":"Folk artist Mame Khan has said that he doesn't want to become Arijit Singh. \"Today, all singers want to be like him, and in the process, are losing their identities,\" he added. \"I choose to maintain my voice, which is why it is valued. I also celebrate my folk roots; it's the strongest aspect [of my personality],\" Mame further said. ","author":"Udit Gupta","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Stopped working with Rajesh Khanna, he came at 12pm for 9am shoot: Sharmila","content":"Veteran actress Sharmila Tagore has revealed that the one thing about late actor Rajesh Khanna that affected her was his habit of coming late for work. The actress added that he never reached before 12pm for a 9am shift. \"And that's why I decided to work with other actors despite knowing that our pairing was quite successful,\" Sharmila said.","author":"Kriti Kambiri","date":"18 Jul","source":null,"category":"entertainment"},{"title":"SRK's look from 'Dunki' leaked, actor spotted shooting in London","content":"Actor Shah Rukh Khan's look from his upcoming film 'Dunki' has been leaked on social media. The actor was seen wearing a half-tucked plaid shirt along with black trousers and sporting a messy hair look while going for a shot on London's Waterloo Bridge. The film is directed by Rajkumar Hirani and also features Taapsee Pannu.","author":"Kriti Kambiri","date":"18 Jul","source":null,"category":"entertainment"},{"title":"We're not getting to spend as much time together as I'd want: Janhvi on family","content":"Janhvi Kapoor said in an interview that she would love to do a film with her actor-brother Arjun Kapoor. \"We're all working so much, we're not getting to spend as much time together as a family as I'd want us to,\" she said, adding, \"So I think the only way...to get...family together is to...do a film and cast everyone in...family.\"","author":"Udit Gupta","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Period films harder, the world needs to be believable: Ranbir on 'Shamshera'","content":"Actor Ranbir Kapoor stated in an interview that period films like 'Shamshera' are harder because the world it is set in needs to be believable. \"Audience...need to know the place and time, they can't be alienated from that. So it's quite tricky,\" he added. The actor further said that if the story is engaging and entertaining, that's what matters.","author":"Kriti Kambiri","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Didn't realise we were making memories: Juhi on 25 years of 'Yes Boss'","content":"Actress Juhi Chawla shared a video montage of scenes from her film 'Yes Boss' on social media to celebrate 25 years since its release. She wrote alongside the video, \"I didn't realise we were making memories...No words to thank the 'Yes Boss' team enough...for making such a lovely film watched by millions even today.\" The film co-stars Shah Rukh Khan.","author":"Kriti Kambiri","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Shooting of Shanaya's 'Bedhadak' to commence next year: Karan Johar","content":"Filmmaker Karan Johar took to Instagram to announce that the shooting for 'Bedhadak' featuring Shanaya Kapoor, Gurfateh Singh Pirzada and Lakshya is set to commence next year. This comes after reports surfaced stating that the film has been shelved. As per the makers' official statement, the actors are currently reading scripts and undergoing workshops for the upcoming film.","author":"Kriti Kambiri","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Was literally a father figure to Arjun Kapoor when he was young: Sanjay","content":"Actor Sanjay Kapoor, opening up about his relationship with nephew and actor Arjun Kapoor, has said, \"I have literally brought him up.\" He added, \"Arjun and I have spent the most amount of time together. It may not seem like that right now, but when Arjun was very young, I was literally a father figure to him.\"","author":"Amartya Sharma","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Had no money, cried myself to sleep: Monica Chauudhary on struggling days","content":"Actress Monica Chauudhary, known for shows like 'Apharan' and 'Salt City', spoke about her struggling days in Mumbai and said that she sometimes had no money for food. \"On those nights, I have cried myself to sleep, thinking that I should go back,\" she added. Monica further said she was \"kicked out of\" many shows and films.","author":"Udit Gupta","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Rejected 'Judwaa 2', didn't want to do 'bachpan ka role': Siddharth Nigam","content":"Actor Siddharth Nigam has revealed that he was offered to play Varun Dhawan's childhood character in the 2017 film 'Judwaa 2'. \"I didn't want to do a 'bachpan ka role'. Otherwise, it becomes difficult to get roles as a male lead,\" he added. Siddharth further said he decided not to do \"popular actors' bachpan ka role\" after doing 'Dhoom 3'.","author":"Udit Gupta","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Grace & style of Dhanush is something to behold: Regé-Jean Page","content":"Regé-Jean Page, speaking about Dhanush in 'The Gray Man', said, \"The grace...style and badassery of that man, is something to behold...that's going to be a thunderbolt in the film.\" \"If Batman was twice as badass, then he might get halfway to where Dhanush is in this film,\" he added. Ryan Gosling and Chris Evans feature in the film.","author":"Amartya Sharma","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Want to show people I'm more than simple, innocent: Janhvi on 'Good...'","content":"Actress Janhvi Kapoor has said 'Good Luck Jerry' is a good opportunity to show people that she is more than simple, innocent and helpless. \"I saw the original film...thought it was cool and funny...Nayanthara was just such a bada** in the film,\" she stated. Janhvi added, \"Nayanthara in that film was...innocent and simple, but her character had a solid arc.\" ","author":"Amartya Sharma","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Rajesh Khanna was very generous, he bought houses for co-stars: Sharmila","content":"Veteran actress Sharmila Tagore, who appeared with Rajesh Khanna in multiple films, has revealed that the late actor used to buy expensive gifts for his co-actors, colleagues and friends. \"I have seen him be very generous...Sometimes he even bought them a house but in return, it seems Kaka had great expectations of them, which eventually strained his relations,\" Sharmila added.","author":"Udit Gupta","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Love you SRK for rehearsing with me, not throwing attitude: Kashmera on 'Yes..'","content":"Actress Kashmera Shah took to Instagram to share a video from 'Yes Boss' and thanked actor Shah Rukh Khan for his support. \"Today I completed 25 years in the Bollywood film industry...Thank you King Khan for putting me at comfort...Love you always for rehearsing with me and not throwing attitude of being the huge star that you were,\" she wrote.","author":"Ria Kapoor","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Samantha to be guest at Indian Film Festival of Melbourne 2022","content":"Actress Samantha Ruth Prabhu will be a key guest at the 2022 Indian Film Festival of Melbourne. The actress will be speaking about her own career and trajectory on August 13 before a live audience. The festival will be holding both physical and virtual events after being online for the past two years due to the COVID-19 pandemic and lockdown.","author":"Kriti Kambiri","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Pic of Shah Rukh Khan shooting for 'Dunki' in London goes viral","content":"A picture of actor Shah Rukh Khan from the sets of Rajkumar Hirani's 'Dunki' in London has gone viral on social media. He was spotted shooting at London's Waterloo for 'Dunki'. The film also features actress Taapsee Pannu. 'Dunki' is set to be based on an illegal route called the 'Donkey Flight' used by Indians to immigrate to other countries.","author":"Amartya Sharma","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Some pap pics look vulgar, then people character assassinate you: Janhvi","content":"Actress Janhvi Kapoor has stated that sometimes photos taken by paparazzi can look vulgar because they are \"taken at a certain angle\" or she is \"photographed in a certain way\". \"People perceive you in a certain way and they character assassinate you, even though you make choices based on your comfort. That bothers me,\" the actress said.","author":"Kriti Kambiri","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Excited to announce my next film starring Kartik Aaryan: Kabir Khan","content":"Filmmaker Kabir Khan took to Instagram to announce his upcoming project with actor Kartik Aaryan. \"I'm excited to announce my next project starring Kartik in a never before seen avatar,\" he wrote on Instagram. Kabir added the project will be based on a \"fascinating true story\". \"We start shooting early next year,\" he further added.","author":"Amartya Sharma","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Kajol to make web series debut, says 'Love to take challenges head-on'","content":"Kajol is set to make her web series debut with an upcoming project. Speaking about it, she said, \"Exploring new formats is always a challenge; but...I love to take challenges head-on.\" \"Being an avid fan of digital series...the concept has always been intriguing,\" she added. Kajol was last seen in the film 'Tribhanga', which premiered on an OTT platform.  ","author":"Udit Gupta","date":"18 Jul","source":null,"category":"entertainment"},{"title":"Ranbir always caught my attention with his work: 'Shamshera' director","content":"'Shamshera' director Karan Malhotra has said that he is happy that he got to work with actor Ranbir Kapoor so early in his career. \"Ranbir always caught my attention with his work...the timing was correct...things just fell into place for us,\" he added. Karan stated that Sanjay Dutt is like a family and added he didn't have any drama.","author":"Amartya Sharma","date":"18 Jul","source":null,"category":"entertainment"},{"title":"'PS-1' director Mani Ratnam receives legal notice over Vikram's look: Report","content":"Filmmaker Mani Ratnam and actor Vikram have reportedly received a legal notice from a lawyer over Vikram's look in the film 'Ponniyin Selvan'. As per the reports, the lawyer alleged Cholas didn't have a 'tilak' on the forehead. In the posters released earlier, Vikram, who plays Aditya Karikalan in the film, can be seen sporting a 'tilak'.","author":"Amartya Sharma","date":"18 Jul","source":null,"category":"entertainment"}]